In [36]:
import numpy as np
import pandas as pd

In [37]:
df=pd.read_csv('cars_dataset.csv')

In [38]:
df

        brand  km_driven      fuel                 owner  selling_price
0    Mahindra      94045       CNG           First Owner        1464652
1      Toyota      39698       LPG          Second Owner        1034604
2     Renault     115078  Electric           Third Owner         943523
3        Tata      85623    Petrol  Fourth & Above Owner         646237
4    Mahindra      27671  Electric  Fourth & Above Owner        1349728
..        ...        ...       ...                   ...            ...
195   Renault      27677       CNG           First Owner        1097083
196      Tata      60609    Diesel          Second Owner        1271459
197    Toyota     192733    Diesel           First Owner         862501
198   Hyundai      36024  Electric          Second Owner         487952
199      Ford      75313  Electric           First Owner         212221

[200 rows x 5 columns]

In [39]:
df['brand'].nunique()

10

In [40]:
df['fuel'].value_counts()

fuel
Electric    50
Diesel      42
LPG         41
Petrol      37
CNG         30
Name: count, dtype: int64

In [41]:
df['owner'].value_counts()

owner
First Owner             67
Fourth & Above Owner    46
Second Owner            44
Third Owner             43
Name: count, dtype: int64

# 1.OneHotEncoding using Pnadas

In [42]:
pd.get_dummies(df,columns=['fuel','owner'])

,brand,km_driven,selling_price,fuel_CNG,fuel_Diesel,fuel_Electric,fuel_LPG,fuel_Petrol,owner_First Owner,owner_Fourth & Above Owner,owner_Second Owner,owner_Third Owner
0,Mahindra,94045,1464652,True,False,False,False,False,True,False,False,False
1,Toyota,39698,1034604,False,False,False,True,False,False,False,True,False
2,Renault,115078,943523,False,False,True,False,False,False,False,False,True
3,Tata,85623,646237,False,False,False,False,True,False,True,False,False
4,Mahindra,27671,1349728,False,False,True,False,False,False,True,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
195,Renault,27677,1097083,True,False,False,False,False,True,False,False,False
196,Tata,60609,1271459,False,True,False,False,False,False,False,True,False
197,Toyota,192733,862501,False,True,False,False,False,True,False,False,False
198,Hyundai,36024,487952,False,False,True,False,False,False,False,True,False
199,Ford,75313,212221,False,False,True,False,False,True,False,False,False

# K-1 OneHotEncoding

In [43]:
pd.get_dummies(df,columns=['fuel','owner'],drop_first=True)

,brand,km_driven,selling_price,fuel_Diesel,fuel_Electric,fuel_LPG,fuel_Petrol,owner_Fourth & Above Owner,owner_Second Owner,owner_Third Owner
0,Mahindra,94045,1464652,False,False,False,False,False,False,False
1,Toyota,39698,1034604,False,False,True,False,False,True,False
2,Renault,115078,943523,False,True,False,False,False,False,True
3,Tata,85623,646237,False,False,False,True,True,False,False
4,Mahindra,27671,1349728,False,True,False,False,True,False,False
...,...,...,...,...,...,...,...,...,...,...
195,Renault,27677,1097083,False,False,False,False,False,False,False
196,Tata,60609,1271459,True,False,False,False,False,True,False
197,Toyota,192733,862501,True,False,False,False,False,False,False
198,Hyundai,36024,487952,False,True,False,False,False,True,False
199,Ford,75313,212221,False,True,False,False,False,False,False

# 3. OneHotEncoding using Sklearn

In [44]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(df.iloc[:,0:4],df.iloc[:,-1],test_size=0.2,random_state=0)

In [45]:
x_train.head()

          brand  km_driven      fuel                 owner
134     Hyundai     154783    Diesel           First Owner
66       Toyota      37711       LPG           First Owner
26   Volkswagen     137874  Electric          Second Owner
113       Honda     175862    Petrol  Fourth & Above Owner
168    Mahindra      59748       CNG           First Owner

In [46]:
x_test.head()

       brand  km_driven      fuel                 owner
18      Ford     147483       CNG           Third Owner
170    Honda     155262       LPG          Second Owner
107  Renault     155810  Electric  Fourth & Above Owner
98       Kia     181597  Electric  Fourth & Above Owner
177  Hyundai      75316    Diesel           Third Owner

In [47]:
from sklearn.preprocessing import OneHotEncoder

In [64]:
ohe=OneHotEncoder(drop='first',sparse_output=False,dtype=np.int32)

In [65]:
x_train_new=ohe.fit_transform(x_train[['fuel','owner']])

In [66]:
x_test_new=ohe.transform(x_train[['fuel','owner']])

In [67]:
x_train_new

array([[1, 0, 0, ..., 0, 0, 0],
       [0, 0, 1, ..., 0, 0, 0],
       [0, 1, 0, ..., 0, 1, 0],
       ...,
       [1, 0, 0, ..., 1, 0, 0],
       [0, 0, 0, ..., 1, 0, 0],
       [0, 0, 0, ..., 0, 0, 1]])

In [68]:
x_train_new.shape

(160, 7)

In [69]:
np.hstack((x_train[['brand','km_driven']].values,x_train_new)).shape

(160, 9)

# OneHotEncoding with Top categories

In [72]:
counts=df['brand'].value_counts()

In [73]:
counts

brand
Mahindra      26
Renault       23
Maruti        23
Tata          20
Kia           20
Volkswagen    19
Honda         19
Toyota        18
Hyundai       17
Ford          15
Name: count, dtype: int64

In [75]:
df['brand'].nunique()
threshold=100

In [78]:
rep1=counts[counts <= threshold].index
rep1

Index(['Mahindra', 'Renault', 'Maruti', 'Tata', 'Kia', 'Volkswagen', 'Honda',
       'Toyota', 'Hyundai', 'Ford'],
      dtype='object', name='brand')

In [80]:
pd.get_dummies(df['brand'].replace(rep1,'uncommon')).sample(5)

     uncommon
23       True
51       True
40       True
126      True
52       True